VPro/src/Documents/LoanContract/LoanContract.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Document>
  <name>LoanContract</name>
  <basedOn>Catalog.Employees</basedOn>
  <registerRecords>InformationRegister.LoanRepaymentSchedule</registerRecords>
  <attributes>
    <name>Company</name>
    <type>
      <types>CatalogRef.Companies</types>
    </type>
  </attributes>
  <attributes>
    <name>LoanKind</name>
    <type>
      <types>EnumRef.LoanContractTypes</types>
    </type>
  </attributes>
  <attributes>
    <name>Employee</name>
    <type>
      <types>CatalogRef.Employees</types>
    </type>
  </attributes>
  <attributes>
    <name>Counterparty</name>
    <type>
      <types>CatalogRef.Counterparties</types>
    </type>
  </attributes>
  <attributes>
    <name>Total</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>InterestRate</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>5</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>SettlementsCurrency</name>
    <type>
      <types>CatalogRef.Currencies</types>
    </type>
  </attributes>
  <attributes>
    <name>ChargeFromSalary</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>RepaymentOption</name>
    <type>
      <types>EnumRef.OptionsOfLoanRepaymentByEmployee</types>
    </type>
  </attributes>
  <attributes>
    <name>PaymentAmount</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Issued</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Maturity</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>FirstRepayment</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>BusinessArea</name>
    <type>
      <types>CatalogRef.BusinessActivities</types>
    </type>
  </attributes>
  <attributes>
    <name>GLAccount</name>
    <type>
      <types>ChartOfAccountsRef.Managerial</types>
    </type>
  </attributes>
  <attributes>
    <name>InterestGLAccount</name>
    <type>
      <types>ChartOfAccountsRef.Managerial</types>
    </type>
  </attributes>
  <attributes>
    <name>CommissionGLAccount</name>
    <type>
      <types>ChartOfAccountsRef.Managerial</types>
    </type>
  </attributes>
  <attributes>
    <name>CostAccount</name>
    <type>
      <types>ChartOfAccountsRef.Managerial</types>
    </type>
  </attributes>
  <attributes>
    <name>CommissionType</name>
    <type>
      <types>EnumRef.LoanCommissionTypes</types>
    </type>
  </attributes>
  <attributes>
    <name>Commission</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>PaymentTerms</name>
    <type>
      <types>EnumRef.LoanRepaymentTerms</types>
    </type>
  </attributes>
  <attributes>
    <name>Author</name>
    <type>
      <types>CatalogRef.Users</types>
    </type>
  </attributes>
  <attributes>
    <name>Comment</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>StructuralUnit</name>
    <type>
      <types>CatalogRef.StructuralUnits</types>
    </type>
  </attributes>
  <attributes>
    <name>Order</name>
    <type>
      <types>DocumentRef.CustomerOrder</types>
    </type>
  </attributes>
  <attributes>
    <name>DeductionPrincipalDebt</name>
    <type>
      <types>CatalogRef.AccrualAndDeductionKinds</types>
    </type>
  </attributes>
  <attributes>
    <name>DeductionInterest</name>
    <type>
      <types>CatalogRef.AccrualAndDeductionKinds</types>
    </type>
  </attributes>
  <attributes>
    <name>DaysInYear360</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <tabularSections>
    <name>PaymentAndAccrualSchedule</name>
    <attributes>
      <name>PaymentDate</name>
      <type>
        <types>Date</types>
        <dateQualifiers>
          <dateFractions>Date</dateFractions>
        </dateQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Principal</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Interest</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Commission</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>PaymentAmount</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Comment</name>
      <type>
        <types>String</types>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>AdditionalAttributes</name>
    <attributes>
      <name>Property</name>
      <type>
        <types>ChartOfCharacteristicTypesRef.AdditionalAttributesAndInformation</types>
      </type>
    </attributes>
    <attributes>
      <name>Value</name>
      <type>
        <types>Characteristic.AdditionalAttributesAndInformation</types>
      </type>
    </attributes>
    <attributes>
      <name>TextString</name>
      <type>
        <types>String</types>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Document>

VPro/src/InformationRegisters/UserReminders/UserReminders.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>UserReminders</name>
  <resources>
    <name>ReminderPeriod</name>
    <type>
      <types>Date</types>
    </type>
  </resources>
  <attributes>
    <name>Definition</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>255</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ReminderTimeSettingVariant</name>
    <type>
      <types>EnumRef.ReminderTimeSettingVariants</types>
    </type>
  </attributes>
  <attributes>
    <name>ReminderInterval</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>SourceAttributeName</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>255</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Schedule</name>
    <type>
      <types>ValueStorage</types>
    </type>
  </attributes>
  <attributes>
    <name>SourcePresentation</name>
    <comment>Source presentation</comment>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>100</length>
      </stringQualifiers>
    </type>
  </attributes>
  <dimensions>
    <name>User</name>
    <type>
      <types>CatalogRef.Users</types>
    </type>
  </dimensions>
  <dimensions>
    <name>EventTime</name>
    <type>
      <types>Date</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Source</name>
    <type>
      <types>ExchangePlanRef</types>
      <types>BusinessProcessRef</types>
      <types>DocumentRef</types>
      <types>ChartOfCalculationTypesRef</types>
      <types>TaskRef</types>
      <types>ChartOfCharacteristicTypesRef</types>
      <types>ChartOfAccountsRef</types>
      <types>CatalogRef</types>
    </type>
  </dimensions>
</mdclass:InformationRegister>

VPro/src/Enums/ReminderTimeSettingVariants/ReminderTimeSettingVariants.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum>
  <name>ReminderTimeSettingVariants</name>
  <enumValues>
    <name>InSpecifiedTime</name>
  </enumValues>
  <enumValues>
    <name>RelativelyToCurrentTime</name>
  </enumValues>
  <enumValues>
    <name>RelativelyToSubjectTime</name>
  </enumValues>
  <enumValues>
    <name>Periodically</name>
  </enumValues>
</mdclass:Enum>

VPro/src/Documents/LoanContract/Forms/ReminderCreationForm/Module.bsl
#Region InternalProceduresAndFunctions

// Procedure sets up hyperlink visibility to open the reminder list.
//
&AtServer
Procedure SetHyperlinkVisibilityThereRemindersOnServer()

	Query = New Query;
	Query.Text = 
	"SELECT TOP 1
	|	UserReminders.Source
	|FROM
	|	InformationRegister.UserReminders AS UserReminders
	|WHERE
	|	UserReminders.Source = &Recorder";
	
	Query.SetParameter("Recorder", Recorder);
	
	RequestResult = Query.Execute();
	
	DetailedRecordSelection = RequestResult.Select();
	
	Items.ThereRemindersForLoanContract.Visible = DetailedRecordSelection.Next();


EndProcedure // SetHyperlinkVisibilityThereRemindersOnServer()

#EndRegion

#Region FormEventHandlers

// Procedure - handler of the WhenCreatingOnServer event of the form.
//
&AtServer
Procedure OnCreateAtServer(Cancel, StandardProcessing)
	
	If Parameters.Property("Autotest") Then // Skipping the initialization to guarantee that the form will be received if the Autotest parameter is passed.
		Return;
	EndIf;

	AddressPaymentAndAccrualScheduleInStorage	= Parameters.AddressPaymentAndAccrualScheduleInStorage;
	DocumentFormID								= Parameters.DocumentFormID;
	Recorder									= Parameters.Recorder;
	User										= Users.CurrentUser();
	CounterpartyBank							= Parameters.CounterpartyBank;
	
	SetHyperlinkVisibilityThereRemindersOnServer();
	
EndProcedure

// Procedure - handler of the WhenOpening event of the form.
//
&AtClient
Procedure OnOpen(Cancel)
	
	If Time = '00010101000000' Then
		Time = '00010101100000';
	EndIf;
	If RadioButtonAccrualDay = 0 Then
		RadioButtonAccrualDay = 1;
	EndIf;
	
EndProcedure

#EndRegion

#Region FormCommandHandlers

// Procedure - handler of the Create forms command.
//
&AtClient
Procedure Create(Command)

	If User.IsEmpty() Then
		ShowMessageBox(Undefined, NStr("en='Select user.';ru='Выберите пользователя!';vi='Hãy chọn người sử dụng.'"));
		Return;
	EndIf;
	
	If Not ValueIsFilled(Time) Then
		ShowMessageBox(Undefined, NStr("en='Set reminder time.';ru='Установите время напоминания!';vi='Hãy thiết lập thời gian nhắc nhớ!'"));
		Return;
	EndIf;
	
	CreateServer();
	
EndProcedure

// Procedure - handler of the Create forms command. Server part.
//
&AtServer
Procedure CreateServer()
	
	//receive accrual table on schedule
	ScheduleFromStorage = GetFromTempStorage(AddressPaymentAndAccrualScheduleInStorage);
	
	If ScheduleFromStorage.Count() > 0 Then
		
		Set = InformationRegisters.UserReminders.CreateRecordSet();
		Set.Filter.User.Set(User);
		Set.Filter.Source.Set(Recorder);
		
		For Each ScheduleLine In ScheduleFromStorage Do
			
			Record = Set.Add();
			
			// Dimensions
			If RadioButtonAccrualDay = 1 Then
				ReminderTimeDate = BegOfDay(BegOfDay(ScheduleLine.PaymentDate) - 1) + 
					Hour(Time) * 3600 + 
					Minute(Time) * 60 + 
					Second(Time);
			Else
				ReminderTimeDate = ScheduleLine.PaymentDate + 
					Hour(Time) * 3600 + 
					Minute(Time) * 60 + 
					Second(Time);
			EndIf;
			
			Record.User			= User;
			Record.EventTime	= ReminderTimeDate;
			Record.Source		= Recorder;
			
			// Resources
			Record.ReminderPeriod = ReminderTimeDate;
			
			// Attributes
			Record.Definition = StringFunctionsClientServer.SubstituteParametersInString(
				NStr("en='Loan payment = %1 (princ. debt = %2; interest amount %3; commission %4) in bank %5.';ru='Платеж = %1 (задолженность = %2; сумма процентов %3; комиссия %4) в банке %5.';vi='Thanh toán = %1 (công nợ = %2; số tiền lãi %3; phí ngân hàng %4) trong ngân hàng %5.'"),
				ScheduleLine.PaymentAmount,
				ScheduleLine.Principal,
				ScheduleLine.Interest,
				ScheduleLine.Commission,
				CounterpartyBank.Description);
				
			Record.ReminderTimeSettingVariant	= Enums.ReminderTimeSettingVariants.InSpecifiedTime;
			Record.ReminderInterval				= 3600;
			Record.SourcePresentation			= "" + Recorder;
			
		EndDo;
		
		Set.Write(True);
		
		Items.ThereRemindersForLoanContract.Title		= NStr("en='Reminders for credit (loan) contract';ru='Напоминание договору по кредита (займа)';vi='Nhắc nhớ cho hợp đồng tín dụng (khoản vay)'");
		Items.ThereRemindersForLoanContract.Visible = True;
		
	EndIf;
	
EndProcedure

#EndRegion

#Region ProceduresHandlersOfEventsFormItems

// Procedure - handler of the Click event of the ThereReminderForLoanContract item.
&AtClient
Procedure ThereRemindersForObjectClick(Item)
	
	FormOpenParameters = New Structure("Filter", New Structure("Source", Recorder));
	OpenForm("InformationRegister.UserReminders.ListForm", FormOpenParameters);
	
EndProcedure

#EndRegion
